alplabai/gd32-bridge-firmware/src/protocol.c
#ifndef GD32_BRIDGE_BUILD_ID
#define GD32_BRIDGE_BUILD_ID "0000000000000000abcd"
#endif

_Static_assert(sizeof(GD32_BRIDGE_BUILD_ID) - 1u == GD32_BRIDGE_BUILD_ID_LEN,
               "build id must be 20 ASCII bytes");

/* --------------------------------------------------------------- */
/* LE-int helpers (firmware side, parallel to the host driver).      */
/* --------------------------------------------------------------- */

static uint32_t get_le32(const uint8_t *p)
{
	return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

static void put_le32(uint8_t *p, uint32_t v)
{
	p[0] = (uint8_t)(v & 0xFFu);
	p[1] = (uint8_t)((v >> 8) & 0xFFu);
	p[2] = (uint8_t)((v >> 16) & 0xFFu);
	p[3] = (uint8_t)((v >> 24) & 0xFFu);
}

/* --------------------------------------------------------------- */
/* Per-opcode handlers                                                */
/* --------------------------------------------------------------- */

/* Translate a BRIDGE_HW_ERR_* return into a STATUS_*.  Centralised so
 * every handler below reports the same code for the same HAL error --
 * forward-declared here (defined with the v0.5 handler set) so the
 * legacy handlers earlier in this file can route through it instead
 * of hand-rolling their own STATUS_IO-flattening ladder (#23). */
static gd32_bridge_status_t status_from_hw(int rv);

static gd32_bridge_status_t
handle_ping(const uint8_t *req, size_t req_len, uint8_t *reply, size_t reply_cap, size_t *reply_len)
{
	(void)req;
	(void)reply;
	(void)reply_cap;
	if (req_len != 0u) return STATUS_INVAL;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_get_version(const uint8_t *req,
                                               size_t         req_len,
                                               uint8_t       *reply,
                                               size_t         reply_cap,
                                               size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 3u) return STATUS_NOMEM;
	reply[0]   = PROTOCOL_VERSION_MAJOR;
	reply[1]   = PROTOCOL_VERSION_MINOR;
	reply[2]   = PROTOCOL_VERSION_PATCH;
	*reply_len = 3u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_get_build_id(const uint8_t *req,
                                                size_t         req_len,
                                                uint8_t       *reply,
                                                size_t         reply_cap,
                                                size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < GD32_BRIDGE_BUILD_ID_LEN) return STATUS_NOMEM;
	memcpy(reply, GD32_BRIDGE_BUILD_ID, GD32_BRIDGE_BUILD_ID_LEN);
	*reply_len = GD32_BRIDGE_BUILD_ID_LEN;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_reset_reason(const uint8_t *req,
                                                size_t         req_len,
                                                uint8_t       *reply,
                                                size_t         reply_cap,
                                                size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	/* bridge_hw_reset_reason() also clears the cause on read so the
     * next caller sees UNKNOWN if no further resets have happened. */
	reply[0]   = bridge_hw_reset_reason();
	*reply_len = 1u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_gpio_read(const uint8_t *req,
                                             size_t         req_len,
                                             uint8_t       *reply,
                                             size_t         reply_cap,
                                             size_t        *reply_len)
{
	if (req_len != 4u) return STATUS_INVAL;
	if (reply_cap < 4u) return STATUS_NOMEM;
	const uint32_t mask   = get_le32(req);
	uint32_t       levels = 0u;
	const int      rv     = bridge_hw_gpio_read(mask, &levels);
	if (rv < 0) return STATUS_IO;
	put_le32(reply, levels);
	*reply_len = 4u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_gpio_write(const uint8_t *req,
                                              size_t         req_len,
                                              uint8_t       *reply,
                                              size_t         reply_cap,
                                              size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 8u) return STATUS_INVAL;
	const uint32_t mask   = get_le32(&req[0]);
	const uint32_t levels = get_le32(&req[4]);
	const int      rv     = bridge_hw_gpio_write(mask, levels);
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_pwm_set(const uint8_t *req,
                                           size_t         req_len,
                                           uint8_t       *reply,
                                           size_t         reply_cap,
                                           size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 10u) return STATUS_INVAL;
	const uint8_t channel = req[0];
	/* req[1] is the reserved padding byte; ignore */
	const uint32_t period_ns = get_le32(&req[2]);
	const uint32_t duty_ns   = get_le32(&req[6]);
	if (duty_ns > period_ns) return STATUS_INVAL;
	const int rv = bridge_hw_pwm_set(channel, period_ns, duty_ns);
	if (rv != BRIDGE_HW_OK) return status_from_hw(rv);
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_pwm_get(const uint8_t *req,
                                           size_t         req_len,
                                           uint8_t       *reply,
                                           size_t         reply_cap,
                                           size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 8u) return STATUS_NOMEM;
	uint32_t  period_ns = 0u;
	uint32_t  duty_ns   = 0u;
	const int rv        = bridge_hw_pwm_get(req[0], &period_ns, &duty_ns);
	if (rv != BRIDGE_HW_OK) return status_from_hw(rv);
	put_le32(&reply[0], period_ns);
	put_le32(&reply[4], duty_ns);
	*reply_len = 8u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_read(const uint8_t *req,
                                            size_t         req_len,
                                            uint8_t       *reply,
                                            size_t         reply_cap,
                                            size_t        *reply_len)
{
	if (req_len != 2u) return STATUS_INVAL;
	uint8_t channel = req[0];
	uint8_t samples = req[1];
	if (samples == 0u) return STATUS_INVAL;
	/* Reject out-of-range sample counts outright rather than silently
     * capping -- the host driver compares `reply[0]` against the
     * originally-requested count and treats a mismatch as a wire
     * error, so silent capping would turn a documented OUT_OF_RANGE
     * caller error into a misleading ALP_ERR_IO. */
	if (samples > GD32_BRIDGE_ADC_MAX_SAMPLES) return STATUS_OUT_OF_RANGE;

	const size_t need = 1u + (size_t)samples * 2u;
	if (reply_cap < need) return STATUS_NOMEM;

