alplabai/gd32-bridge-firmware/src/protocol.c
	const size_t need = 1u + (size_t)max_samples * 2u;
	if (reply_cap < need) return STATUS_NOMEM;
	reply[0] = got;
	for (uint8_t i = 0u; i < got; ++i) {
		reply[1u + i * 2u]      = (uint8_t)(mv[i] & 0xFFu);
		reply[1u + i * 2u + 1u] = (uint8_t)((mv[i] >> 8) & 0xFFu);
	}
	/* Pad with zeros so the on-wire envelope length is deterministic
     * (host pre-committed to clocking 1 + max_samples*2 reply bytes
     * + CRC).  Filler bytes are zero so the CRC is reproducible. */
	for (uint8_t i = got; i < max_samples; ++i) {
		reply[1u + i * 2u]      = 0u;
		reply[1u + i * 2u + 1u] = 0u;
	}
	*reply_len = need;
	return STATUS_OK;
}

/* CMD_ADC_SPECTRUM_READ (#496): one chunk of the latest FFT frame for an
 * FFT-terminal chain.  req: stream_id:u8 bin_offset:u16(LE) max_bins:u8.
 * reply (fixed 7 + max_bins*4): seq:u32 total_bins:u16 got:u8 bins[]
 * (float32 LE, zero-padded past `got`). */
static gd32_bridge_status_t handle_adc_spectrum_read(const uint8_t *req,
                                                     size_t         req_len,
                                                     uint8_t       *reply,
                                                     size_t         reply_cap,
                                                     size_t        *reply_len)
{
	if (req_len != 4u) return STATUS_INVAL;
	const uint8_t  stream_id  = req[0];
	const uint16_t bin_offset = (uint16_t)(req[1] | ((uint16_t)req[2] << 8));
	const uint8_t  max_bins   = req[3];
	if (stream_id >= GD32_BRIDGE_ADC_STREAM_COUNT) return STATUS_INVAL;
	if (max_bins == 0u) return STATUS_INVAL;
	if (max_bins > GD32_BRIDGE_ADC_SPECTRUM_READ_MAX) return STATUS_OUT_OF_RANGE;

	float     bins[GD32_BRIDGE_ADC_SPECTRUM_READ_MAX];
	uint32_t  seq   = 0u;
	uint16_t  total = 0u;
	uint8_t   got   = 0u;
	const int rv =
	    bridge_hw_adc_spectrum_read(stream_id, bin_offset, max_bins, &seq, &total, &got, bins);
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT; /* not FFT-bound */
	if (rv == BRIDGE_HW_ERR_IO) return STATUS_BUSY;           /* no frame yet -> poll */
	if (rv < 0) return STATUS_IO;
	if (got > max_bins) return STATUS_IO; /* HAL contract violation */

	const size_t need = 7u + (size_t)max_bins * 4u;
	if (reply_cap < need) return STATUS_NOMEM;
	reply[0] = (uint8_t)(seq & 0xFFu);
	reply[1] = (uint8_t)((seq >> 8) & 0xFFu);
	reply[2] = (uint8_t)((seq >> 16) & 0xFFu);
	reply[3] = (uint8_t)((seq >> 24) & 0xFFu);
	reply[4] = (uint8_t)(total & 0xFFu);
	reply[5] = (uint8_t)((total >> 8) & 0xFFu);
	reply[6] = got;
	for (uint8_t i = 0u; i < max_bins; ++i) {
		uint32_t w = 0u;
		if (i < got) memcpy(&w, &bins[i], sizeof(w)); /* float32 -> LE bytes */
		reply[7u + i * 4u]      = (uint8_t)(w & 0xFFu);
		reply[7u + i * 4u + 1u] = (uint8_t)((w >> 8) & 0xFFu);
		reply[7u + i * 4u + 2u] = (uint8_t)((w >> 16) & 0xFFu);
		reply[7u + i * 4u + 3u] = (uint8_t)((w >> 24) & 0xFFu);
	}
	*reply_len = need;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_stream_end(const uint8_t *req,
                                                  size_t         req_len,
                                                  uint8_t       *reply,
                                                  size_t         reply_cap,
                                                  size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 1u) return STATUS_INVAL;
	const uint8_t stream_id = req[0];
	if (stream_id >= GD32_BRIDGE_ADC_STREAM_COUNT) return STATUS_INVAL;
	const int rv = bridge_hw_adc_stream_end(stream_id);
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_trng_read(const uint8_t *req,
                                             size_t         req_len,
                                             uint8_t       *reply,
                                             size_t         reply_cap,
                                             size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	const uint8_t want = req[0];
	if (want == 0u || want > 32u) return STATUS_INVAL;
	if (reply_cap < want) return STATUS_NOMEM;
	const int rv = bridge_hw_trng_read(reply, (size_t)want);
	if (rv != BRIDGE_HW_OK) return status_from_hw(rv);
	*reply_len = want;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_tmu_compute(const uint8_t *req,
                                               size_t         req_len,
                                               uint8_t       *reply,
                                               size_t         reply_cap,
                                               size_t        *reply_len)
{
	if (req_len != 12u) return STATUS_INVAL;
	if (reply_cap < 4u) return STATUS_NOMEM;
	const uint8_t function = req[0];
	const uint8_t format   = req[1];
	/* req[2..3] are the reserved padding -- ignore. */
	const uint32_t in_a = get_le32(&req[4]);
	const uint32_t in_b = get_le32(&req[8]);
	/* Range-check function + format on the firmware side so the host
     * gets a precise STATUS_INVAL rather than a misleading STATUS_IO
     * out of the HAL backend.  The host driver already pre-validates;
     * this is the defence-in-depth pass. */
	if (function >= (uint8_t)BRIDGE_TMU_FN__COUNT) return STATUS_INVAL;
	if (format >= (uint8_t)BRIDGE_TMU_FMT__COUNT) return STATUS_INVAL;

	uint32_t  result = 0u;
	const int rv     = bridge_hw_tmu_compute(function, format, in_a, in_b, &result);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	put_le32(reply, result);
	*reply_len = 4u;
	return STATUS_OK;
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B.2) -- advanced timer extras                              */
/*                                                                    */
/* Wire frames per alp-sdk docs/gd32-bridge-protocol.md §3.y.  Every  */
/* handler validates the request payload length, calls into the HAL  */
/* hook, and maps the BRIDGE_HW_ERR_* return into the on-wire        */
/* STATUS_* code.  On the stub backend (bridge_hw_stub.c) all of     */
/* these return BRIDGE_HW_ERR_NOTIMPL -- which protocol_dispatch     */
/* maps to STATUS_NOSUPPORT on the wire -- so host code sees a       */
/* precise NOSUPPORT contract; the gd32 backend's real bodies live   */
/* in the per-peripheral TUs under hal/gd32/.                        */
/* ----------------------------------------------------------------- */

/* Translate a BRIDGE_HW_ERR_* return into a STATUS_*.  Centralised so
 * the new handler set has identical mapping. */
static gd32_bridge_status_t status_from_hw(int rv)
{
	if (rv == BRIDGE_HW_OK) return STATUS_OK;
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv == BRIDGE_HW_ERR_BUSY) return STATUS_BUSY;
	return STATUS_IO;
}

static gd32_bridge_status_t handle_pwm_capture_begin(const uint8_t *req,
                                                     size_t         req_len,
                                                     uint8_t       *reply,
                                                     size_t         reply_cap,
                                                     size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 2u) return STATUS_INVAL;
	if (req[1] > 2u) return STATUS_INVAL; /* edge ∈ {RISING, FALLING, BOTH} */
	const int rv = bridge_hw_pwm_capture_begin(req[0], req[1]);
	*reply_len   = 0u;
	return status_from_hw(rv);
}

static gd32_bridge_status_t handle_pwm_capture_read(const uint8_t *req,
                                                    size_t         req_len,
                                                    uint8_t       *reply,
                                                    size_t         reply_cap,
                                                    size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 8u) return STATUS_NOMEM;
	uint32_t                   period_ns = 0u;
	uint32_t                   pulse_ns  = 0u;
	const int                  rv = bridge_hw_pwm_capture_read(req[0], &period_ns, &pulse_ns);
	const gd32_bridge_status_t s  = status_from_hw(rv);
	if (s != STATUS_OK) {
		*reply_len = 0u;
		return s;
	}
	put_le32(&reply[0], period_ns);
	put_le32(&reply[4], pulse_ns);
	*reply_len = 8u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_pwm_capture_end(const uint8_t *req,
                                                   size_t         req_len,
                                                   uint8_t       *reply,
                                                   size_t         reply_cap,
                                                   size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 1u) return STATUS_INVAL;
	const int rv = bridge_hw_pwm_capture_end(req[0]);
	*reply_len   = 0u;
	return status_from_hw(rv);
}

static gd32_bridge_status_t handle_pwm_single_pulse(const uint8_t *req,
                                                    size_t         req_len,
                                                    uint8_t       *reply,
                                                    size_t         reply_cap,
                                                    size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 8u) return STATUS_INVAL;
	/* req[1..3] are reserved padding -- ignored by the firmware so
     * future-rev hosts can repurpose without an opcode bump. */
	const uint32_t pulse_ns = get_le32(&req[4]);
	if (pulse_ns == 0u) return STATUS_INVAL; /* zero-width pulse is a caller bug */
	const int rv = bridge_hw_pwm_single_pulse(req[0], pulse_ns);
	*reply_len   = 0u;
	return status_from_hw(rv);
}

static gd32_bridge_status_t handle_timer_sync(const uint8_t *req,
                                              size_t         req_len,
                                              uint8_t       *reply,
                                              size_t         reply_cap,
                                              size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 3u) return STATUS_INVAL;
	const int rv = bridge_hw_timer_sync(req[0], req[1], req[2]);
	*reply_len   = 0u;
	return status_from_hw(rv);
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B.3) -- system power-mode set                              */
/* ----------------------------------------------------------------- */

static gd32_bridge_status_t handle_power_mode_set(const uint8_t *req,
                                                  size_t         req_len,
                                                  uint8_t       *reply,
                                                  size_t         reply_cap,
                                                  size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 10u) return STATUS_INVAL;
	if (req[0] > 3u) return STATUS_INVAL; /* mode ∈ {RUN, SLEEP, DEEP_SLEEP, STANDBY} */
	/* req[1] is reserved padding. */
	const uint32_t wake_bitmap   = get_le32(&req[2]);
	const uint32_t wake_after_ms = get_le32(&req[6]);
	const int      rv            = bridge_hw_power_mode_set(req[0], wake_bitmap, wake_after_ms);
	*reply_len                   = 0u;
	return status_from_hw(rv);
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B wave-2) -- chunked DSP-chain upload                      */
/*                                                                    */
/* Wire frames per alp-sdk docs/gd32-bridge-protocol.md §3.x.         */
/* ----------------------------------------------------------------- */

