alplabai/gd32-bridge-firmware/src/protocol.c
static gd32_bridge_status_t handle_adc_dsp_chain_open(const uint8_t *req,
                                                      size_t         req_len,
                                                      uint8_t       *reply,
                                                      size_t         reply_cap,
                                                      size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	uint8_t                    chain_id = 0u;
	const int                  rv       = bridge_hw_adc_dsp_chain_open(&chain_id);
	const gd32_bridge_status_t s        = status_from_hw(rv);
	if (s != STATUS_OK) {
		*reply_len = 0u;
		return s;
	}
	reply[0]   = chain_id;
	*reply_len = 1u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_dsp_stage_push(const uint8_t *req,
                                                      size_t         req_len,
                                                      uint8_t       *reply,
                                                      size_t         reply_cap,
                                                      size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	/* Header is 7 bytes: chain_id, stage_index, kind, chunk_offset:u16,
     * chunk_total_size:u16.  chunk_data follows at req[7..req_len). */
	if (req_len < 7u) return STATUS_INVAL;
	if (req[2] > 3u) return STATUS_INVAL; /* kind ∈ {FIR, IIR, WINDOW, FFT} */
	const uint8_t  chain_id         = req[0];
	const uint8_t  stage_index      = req[1];
	const uint8_t  kind             = req[2];
	const uint16_t chunk_offset     = (uint16_t)req[3] | ((uint16_t)req[4] << 8);
	const uint16_t chunk_total_size = (uint16_t)req[5] | ((uint16_t)req[6] << 8);
	const size_t   chunk_data_len   = req_len - 7u;
	const uint8_t *chunk_data       = (chunk_data_len > 0u) ? &req[7] : (const uint8_t *)0;
	/* Defence-in-depth: chunk_data + chunk_offset must stay within the
     * declared chunk_total_size.  The host helper already enforces
     * this, but firmware re-checks so a malformed wire request can't
     * walk past the per-stage scratch buffer. */
	if ((uint32_t)chunk_offset + (uint32_t)chunk_data_len > (uint32_t)chunk_total_size) {
		return STATUS_OUT_OF_RANGE;
	}
	const int rv = bridge_hw_adc_dsp_stage_push(
	    chain_id, stage_index, kind, chunk_offset, chunk_total_size, chunk_data, chunk_data_len);
	*reply_len = 0u;
	return status_from_hw(rv);
}

static gd32_bridge_status_t handle_adc_dsp_chain_bind(const uint8_t *req,
                                                      size_t         req_len,
                                                      uint8_t       *reply,
                                                      size_t         reply_cap,
                                                      size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 2u) return STATUS_INVAL;
	if (req[1] >= GD32_BRIDGE_ADC_STREAM_COUNT) return STATUS_INVAL;
	const int rv = bridge_hw_adc_dsp_chain_bind(req[0], req[1]);
	*reply_len   = 0u;
	return status_from_hw(rv);
}

/* --------------------------------------------------------------- */
/* v0.7 -- link-feature negotiation                                  */
/* --------------------------------------------------------------- */

/* Armed link features (GD32_BRIDGE_LINK_FEAT_*), ONE ENTRY PER LINK.
 * The negotiation command can arrive over either transport; the SPI
 * transport consults the accessor when it stages replies (the I2C
 * transport never stamps -- STATUS_NO_PENDING owns bit 7 there).  Reset
 * default: everything off = the pre-v0.7 wire, so an un-negotiated link
 * is byte-identical to older firmware.
 *
 * #130: this was a single process-wide byte.  CMD_LINK_FEATURES sits in
 * the shared dispatch table and is therefore reachable from BOTH
 * transport ISRs, but only the SPI transport consumes the result -- so
 * an I2C-side driver open/close/reset issuing the documented idempotent
 * `features = 0` disarmed an active SPI STATUS_SEQ session with nothing
 * telling the SPI host, switching off its only detector for the
 * stale-reply residual hazard (src/transport_spi.c stale-reply note,
 * silicon 2026-06-06).  The reverse was equally reachable: an I2C-side
 * `features = 1` re-framed the SPI wire for a host that never
 * negotiated it.
 *
 * `volatile` because the two writers run at different NVIC preemption
 * levels -- CS-EXTI at BRIDGE_CS_IRQ_PRIO (1) can preempt I2C0_EV at
 * BRIDGE_I2C_IRQ_PRIO (2) mid-handler (hal/bridge_board_config.h).
 * Indexing by link means the two levels no longer touch the same byte,
 * so the qualifier is now belt-and-braces rather than load-bearing --
 * but the array is still read from one level and written from another
 * for its own link, and this build sets no -O at all (#26), which is
 * the only reason the pre-#130 miss was not already observable. */
static volatile uint8_t link_features[GD32_BRIDGE_LINK_COUNT];

uint8_t protocol_link_features(gd32_bridge_link_t link)
{
	if ((unsigned)link >= (unsigned)GD32_BRIDGE_LINK_COUNT) return 0u;
	return link_features[link];
}

/* The one link-SCOPED handler, so it does not match cmd_handler_t and is
 * called directly from protocol_dispatch's switch instead of going
 * through the table (#130).  Passing the tag as an argument -- rather
 * than parking a "current link" in a file-scope variable the whole table
 * could read -- is deliberate: CS-EXTI at priority 1 preempts I2C0_EV at
 * priority 2, so any such variable would need save/restore discipline at
 * every dispatch to survive nesting.  An argument needs none. */
static gd32_bridge_status_t handle_link_features(gd32_bridge_link_t link,
                                                 const uint8_t     *req,
                                                 size_t             req_len,
                                                 uint8_t           *reply,
                                                 size_t             reply_cap,
                                                 size_t            *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	if ((unsigned)link >= (unsigned)GD32_BRIDGE_LINK_COUNT) return STATUS_INVAL;
	/* Grant the intersection of the request with what this firmware
     * implements, and arm it IMMEDIATELY -- the reply to this very
     * command already rides the new framing (the host treats its
     * stamp as the sequence baseline).  A request of 0 disables
     * everything; idempotent in both directions.
     *
     * Armed for THIS link only.  A host negotiating on I2C gets an
     * honest echo of what it asked for and a working per-link record,
     * but cannot reach the SPI link's framing.  STATUS_SEQ has no
     * effect on the I2C wire either way (that transport never stamps),
     * so the I2C answer stays truthful rather than STATUS_NOSUPPORT --
     * which would break the documented idempotent open/close path that
     * issues `features = 0` unconditionally. */
	link_features[link] = (uint8_t)(req[0] & GD32_BRIDGE_LINK_FEAT_STATUS_SEQ);
	reply[0]            = link_features[link];
	*reply_len          = 1u;
	return STATUS_OK;
}

/* --------------------------------------------------------------- */
/* Dispatch                                                          */
/* --------------------------------------------------------------- */

